// import {FETCH_PERIOD} from '../actions/index';

// Hardcoding ver.
export default function(state=null, action) {
    return [
        {   topic: '카카오톡, 카톡, 오류, 장애, 정상', 
            voclist: [ {id: '1', dt: '20200910', hhmmss: '102023', memo: '카카오톡 어쩌고 저쩌고'},
            {id: '2', dt: '20200910', hhmmss: '102023', memo: '자택 내 통화품질 불량. 고층 특성 안내 어저꼬저쩌고저쩌고'},
            {id: '3', dt: '20200910', hhmmss: '102023', memo: '자택 내 통화품질 불량. 고층 특성 안내 어저꼬저쩌고저쩌고'}
            ] 
        },
        {   topic: '연락, 추가, 불량, 상호명, 요청', 
            voclist: [ {id: '4', dt: '20200910', hhmmss: '102023', memo: '초기화 안내. 고층 특성 안내 어쩌고'},
            {id: '5', dt: '20200910', hhmmss: '102023', memo: '자택 내 통화품질 불량. 고층 특성 안내 어저꼬저쩌고저쩌고'},
            {id: '6', dt: '20200910', hhmmss: '102023', memo: '자택 내 통화품질 불량. 고층 특성 안내 어저꼬저쩌고저쩌고'}
            ] 
        },
        {   topic: '위치, 통화, 데이터, 불량, 권유', 
            voclist: [ {id: '7', dt: '20200910', hhmmss: '102023', memo: '중계기 고장난듯 불량. 고저쩌고'},
            {id: '8', dt: '20200910', hhmmss: '102023', memo: '자택 내 통화품질 불량. 고층 특성 안내 어저꼬저쩌고저쩌고'},
            {id: '9', dt: '20200910', hhmmss: '102023', memo: '자택 내 통화품질 불량. 고층 특성 안내 어저꼬저쩌고저쩌고'}
            ] 
        },
        {   topic: '데이터, 초기화, 정상, 위치, 설정', 
            voclist: [ {id: '10', dt: '20200910', hhmmss: '102023', memo: '이용 실패 쩌고'},
            {id: '11', dt: '20200910', hhmmss: '102023', memo: '자택 내 통화품질 불량. 고층 특성 안내 어저꼬저쩌고저쩌고'},
            {id: '12', dt: '20200910', hhmmss: '102023', memo: '자택 내 통화품질 불량. 고층 특성 안내 어저꼬저쩌고저쩌고'}
            ] 
        },
        {   topic: '불량, 특이, 품질, 통화, 기타', 
            voclist: [ {id: '13', dt: '20200910', hhmmss: '102023', memo: '동일 동일 저꼬저쩌고저쩌고'},
            {id: '14', dt: '20200910', hhmmss: '102023', memo: '자택 내 통화품질 불량. 고층 특성 안내 어저꼬저쩌고저쩌고'},
            {id: '15', dt: '20200910', hhmmss: '102023', memo: '자택 내 통화품질 불량. 고층 특성 안내 어저꼬저쩌고저쩌고'}
            ] 
        }
    ]
}

// API ver.